[ { "id": "2434816774",
    "userName": "Pickle-Lickle",
    "userUrl": "https://itunes.apple.com/us/reviews/id16803255",
    "version": "2.0",
    "score": 5,
    "title": "Excellent update",
    "text": "Version 2.0 is very well done. I like the map feature. Interface has high attention to detail, much like the bike itself. \n\nIt would be cool if there was a geofencing feature that would disable auto-wakeup. At work I like auto-wakeup and want it ON. At home I’d like if OFF because I do not want my bike turning on as I walk around the house. Probably not worth the development effort... but would be cool.",
    "url": "https://itunes.apple.com/us/review?id=1119135275&type=Purple%20Software" },
  { "id": "2392977063",
    "userName": "piforbreakfast",
    "userUrl": "https://itunes.apple.com/us/reviews/id546051312",
    "version": "2.0",
    "score": 3,
    "title": "Good simple app, would like true stabdalone app",
    "text": "I’d like to see this work standalone with the Series 3. I have cellular on my watch, would be nice to take it just my watch out with my bike and be able to unlock without my phone!",
    "url": "https://itunes.apple.com/us/review?id=1119135275&type=Purple%20Software" },
  { "id": "2361805298",
    "userName": "Alport2012",
    "userUrl": "https://itunes.apple.com/us/reviews/id30313105",
    "version": "1.7.1",
    "score": 3,
    "title": "Good Start",
    "text": "Looking forward to a more sophisticated app.",
    "url": "https://itunes.apple.com/us/review?id=1119135275&type=Purple%20Software" },
  { "id": "2330639928",
    "userName": "AOdgaard",
    "userUrl": "https://itunes.apple.com/us/reviews/id22055704",
    "version": "1.7.1",
    "score": 1,
    "title": "Horrible Connectivity",
    "text": "I purchased a Smart Bike in hopes that the technology would be as advertised. This is my second VanMoof as my other was stolen: same quality bike but not smart. \n\nYou cannot conveniently walk up to the bike with the phone in your pocket and tap to unlock. I have all settings for the app turned on (background refresh, location tracking, etc) and I still have to take my phone out of my pocket and unlock it for my bike to recognize me and allow me to tap to unlock. \n\nMy second and biggest complaint is the headlight not working unless I “start my bike up” by opening the VanMoof app so the “auto on” feature (not so auto on if I have to perform this much manual work) turns on and the taillight blinks. Only then will my headlight work. If you simply hop on the bike and begin peddling the headlight will not work!!! This is my biggest disappointment as my generation 1 VanMoof’s Light would power up upon cycling. It would even slowly die out after riding as the power from the hub drained out. On this bike, you stop riding, the light turns off immediately. Lame. \n\nI really hope they get this fixed via the app because I want to like the convenience of this bike; however it does not perform as advertised.",
    "url": "https://itunes.apple.com/us/review?id=1119135275&type=Purple%20Software" },
  { "id": "2021907833",
    "userName": "samer_salem",
    "userUrl": "https://itunes.apple.com/us/reviews/id104675040",
    "version": "1.7.0",
    "score": 2,
    "title": "Lights?",
    "text": "I turned off the light while I kept my bike inside the house because it would stay on with auto wake turned on, now I can’t seem to turn the lights back on again, tried all possible remedies with this app, restarted phone, deleted and reinstalled the app, nothing worked.",
    "url": "https://itunes.apple.com/us/review?id=1119135275&type=Purple%20Software" },
  { "id": "1890070538",
    "userName": "juanjoduran",
    "userUrl": "https://itunes.apple.com/us/reviews/id10820962",
    "version": "1.7.0",
    "score": 3,
    "title": "Stand alone Watch app? Please!",
    "text": "Now that issues like touch to unlock finally work. And you launch an Apple Watch companion app, it’s be great if this Apple Watch could work as a stand alone, without the need of an iPhone. Like Shazam app does. That’s the future!  Especially useful for Apple Watch 3 users, since you can truly leave your phone, take your Vanmoof and unlock it, while taking calls from your watch or listening to music. Please! Also, last trip mileage would be great. Not just a total odometer.",
    "url": "https://itunes.apple.com/us/review?id=1119135275&type=Purple%20Software" },
  { "id": "1881529254",
    "userName": "cmaier",
    "userUrl": "https://itunes.apple.com/us/reviews/id5999599",
    "version": "1.7.0",
    "score": 2,
    "title": "So so",
    "text": "Apple Watch app hasn’t worked for me at all - just sits at “connecting” forever. \n\nTouch unlock hardly ever works, even with the phone touching the bike and maximum distance setting. \n\nOther than that, app is ok. But it would be much nicer not to need the app to unlock the bike - Bluetooth hiccups are scary.  i Keep a battery/usb cable in my bike bag just in case things go awry.\n\nAs for the new features, the odometer says 0 miles, though it was 300 miles an hour ago. So not fully baked.",
    "url": "https://itunes.apple.com/us/review?id=1119135275&type=Purple%20Software" },
  { "id": "1880060546",
    "userName": "Prime.",
    "userUrl": "https://itunes.apple.com/us/reviews/id42466891",
    "version": "1.7.0",
    "score": 5,
    "title": "Good update",
    "text": "I’m digging the addition of Apple Watch support. Looking forward to firmware updates that improve the stability of the bike OS.",
    "url": "https://itunes.apple.com/us/review?id=1119135275&type=Purple%20Software" },
  { "id": "1813982695",
    "userName": "P.Cuca",
    "userUrl": "https://itunes.apple.com/us/reviews/id142515055",
    "version": "1.6.1",
    "score": 1,
    "title": "Should be straightforward and is not",
    "text": "Impossible to pair. The process is cumbersome. Very disappointed. The app only works with the bike once, after it I have to uninstall it and install it again",
    "url": "https://itunes.apple.com/us/review?id=1119135275&type=Purple%20Software" },
  { "id": "1813649335",
    "userName": "Cheesy Flip Flop",
    "userUrl": "https://itunes.apple.com/us/reviews/id139848202",
    "version": "1.6.1",
    "score": 3,
    "title": "Usually works",
    "text": "Great when it works but it’s frustrating when it can’t connect and the key fob won’t function as a backup to unlock. This means I always have to have my USB cable with me to reset and solve the issue. Would love an app for the Apple Watch.",
    "url": "https://itunes.apple.com/us/review?id=1119135275&type=Purple%20Software" },
  { "id": "1757994554",
    "userName": "Tim Haines",
    "userUrl": "https://itunes.apple.com/us/reviews/id42333815",
    "version": "1.6.1",
    "score": 1,
    "title": "Unreliable",
    "text": "App\"s crashing when I open it, so I couldn\"t unlock my bike.  Tried turning my phone off and on.  Tried deleting and reinstalling the app.  Still crashed. Had to leave my bike in San Fransisco overnight and catch a Lyft.  Not sure how I\"m going to retrieve my bike if the app\"s still crashing tomorrow.",
    "url": "https://itunes.apple.com/us/review?id=1119135275&type=Purple%20Software" },
  { "id": "1712967440",
    "userName": "Ami in DE",
    "userUrl": "https://itunes.apple.com/us/reviews/id5727235",
    "version": "1.6.1",
    "score": 1,
    "title": "Stranded me",
    "text": "The app just freaked out and blinks on and off. Stuck bike, no remote and now will have to spend on an uber home then back at some point to try and recover my bike. \n\nThink I\"m going to stop using the smart lock and just go with an old school lock.",
    "url": "https://itunes.apple.com/us/review?id=1119135275&type=Purple%20Software" },
  { "id": "1647980646",
    "userName": "roborg",
    "userUrl": "https://itunes.apple.com/us/reviews/id37218069",
    "version": "1.6",
    "score": 2,
    "title": "Needs work.",
    "text": "No ability to control more than one bike. We be nice to be able to map ride.",
    "url": "https://itunes.apple.com/us/review?id=1119135275&type=Purple%20Software" },
  { "id": "1513392636",
    "userName": "stevencub",
    "userUrl": "https://itunes.apple.com/us/reviews/id37120392",
    "version": "1.3",
    "score": 4,
    "title": "Great but I want more",
    "text": "The app works fine but id like to see more updates so I can see things like... How much estimated ride distance on current help rate, historical bike trip info, ability to have blinking rear light, 12 hr rain warning, & service request.",
    "url": "https://itunes.apple.com/us/review?id=1119135275&type=Purple%20Software" },
  { "id": "1477994689",
    "userName": "Gdurantv",
    "userUrl": "https://itunes.apple.com/us/reviews/id250110608",
    "version": "1.3",
    "score": 5,
    "title": "Great app",
    "text": "I love my VanMoof bike and I love this app. I love that I can not only unlock my bike but that I can also control all of the bike\"s utilities. I do wish that in future updates VanMoof would let you see your bikes location via the app, I think it\"s the only missing thing on this wonderful app.",
    "url": "https://itunes.apple.com/us/review?id=1119135275&type=Purple%20Software" } ]
